In [ ]:
#!pip install pandas
#!pip install faker

In [1]:
import sqlite3
from faker import Faker
from random import randint, choice
import pandas as pd

In [2]:
fake = Faker('pt_BR')

# Conectando e entendendo o banco criado pelo Django

In [3]:
conn = sqlite3.connect('db.sqlite3')

In [4]:
cur = conn.cursor()

## Vendo os nomes das tabelas que o Django criou

In [5]:
query = '''
SELECT name
FROM sqlite_master 
WHERE type ='table' AND name NOT LIKE 'sqlite_%';
'''

cur.execute(query)
for c in cur.fetchall():
    print(c)

('django_migrations',)
('auth_group_permissions',)
('auth_user_groups',)
('auth_user_user_permissions',)
('django_admin_log',)
('django_content_type',)
('auth_permission',)
('auth_group',)
('auth_user',)
('pages_interesses',)
('django_session',)
('pages_aluno',)
('pages_perguntas',)
('pages_aluno_interesses',)

## Acessando cada tabela

In [6]:
df = pd.read_sql_query('SELECT * FROM pages_interesses', conn)
df.head()

   id categoria  grau        nome
0   1      Arte     1      Musica
1   2      Arte     1       Dança
2   3      Arte     1  Literatura
3   4      Arte     1       Museu
4   5      Arte     1      Cinema

In [7]:
df = pd.read_sql_query('SELECT * FROM pages_aluno', conn)
df.head()

,id,nome,idade,sexo,curso,periodo
0,1,João Gabriel Barbosa,F,46,Matemática Aplicada,3
1,2,Dr. Davi das Neves,M,22,Ciência de Dados e Inteligência Artificial,5
2,3,Yuri Barbosa,F,26,Matemática Aplicada,5
3,4,Luiz Fernando Souza,M,49,Ciência de Dados e Inteligência Artificial,7
4,5,Stella Nunes,F,16,Matemática Aplicada,2

In [8]:
df = pd.read_sql_query('SELECT * FROM pages_aluno_interesses', conn)
df.head()

   id  aluno_id_id  interesses_id_id
0   1          197                89
1   2           37               149
2   3          194                34
3   4          337               125
4   5          146               174

## Zerando os dados das tabelas

In [9]:
cur.execute('DELETE FROM pages_interesses')
cur.execute('DELETE FROM pages_aluno')
cur.execute('DELETE FROM pages_aluno_interesses')

In [10]:
cur.execute("SELECT * FROM pages_aluno")
for c in cur.fetchmany(15):
    print(c)

In [11]:
cur.execute("SELECT * FROM pages_interesses")
for c in cur.fetchmany(15):
    print(c)

In [12]:
cur.execute("SELECT * FROM pages_aluno_interesses")
for c in cur.fetchmany(15):
    print(c)

# Criando dados fakes

## Tabela pages_interesses

In [13]:
categorias = []
categorias.extend(['Arte']*6)
categorias.extend(['Esporte']*10)
categorias.extend(['Entretenimento']*5)
categorias.extend(['Estilos de Música']*12)
categorias.extend(['Social']*9)

In [14]:
nomes = ['Musica', 'Dança', 'Literatura', 'Museu', 'Cinema', 'Teatro',
'Xadrez', 'Volei', 'Futebol', 'Handbol', 'Basquete', 'Tenis de Mesa', 'Natação', 'Crossfit', 'Musculação', 'Golfe',
'Jogos', 'Séries', 'Filmes', 'Novelas', 'Livros',
'Pop', 'Samba', 'Pagode', 'Sertanejo', 'R&B', 'Jazz', 'Blues', 'Piseiro', 'KPOP', 'Funk', 'Rap', 'Trap',
'Festas', 'Boate', 'Churrasco', 'Roda de Samba', 'Passeio no Parque', 'Praia', 'Trilha', 'Piquenique', 'Montanhas']

In [15]:
graus = []
graus.extend([1]*42)
graus.extend([2]*42)
graus.extend([3]*42)
graus.extend([4]*42)
graus.extend([5]*42)

In [16]:
ids = range(1,211)

In [17]:
categorias.extend(categorias*4)
nomes.extend(nomes*4)

In [18]:
interesses = {
    'id': ids,
    'categoria': categorias,
    'grau': graus,
    'nome': nomes
}
df_int = pd.DataFrame(interesses)

In [19]:
df_int

      id categoria  grau               nome
0      1      Arte     1             Musica
1      2      Arte     1              Dança
2      3      Arte     1         Literatura
3      4      Arte     1              Museu
4      5      Arte     1             Cinema
..   ...       ...   ...                ...
205  206    Social     5  Passeio no Parque
206  207    Social     5              Praia
207  208    Social     5             Trilha
208  209    Social     5         Piquenique
209  210    Social     5          Montanhas

[210 rows x 4 columns]

## Tabela pages_alunos

In [20]:
alunos = {
    'id': [],
    'nome':[],
    'idade':[],
    'sexo':[],
    'curso':[],
    'periodo':[]
}


for id in range(1,401):
    alunos['id'].append(id)
    alunos['nome'].append(fake.name())
    alunos['idade'].append(randint(15,50))
    alunos['sexo'].append(choice(['M','F']))
    alunos['curso'].append(choice(['Ciência de Dados e Inteligência Artificial', 'Matemática Aplicada']))
    alunos['periodo'].append(randint(1,8))

In [21]:
df_alunos = pd.DataFrame(alunos)

In [22]:
df_alunos

,id,nome,idade,sexo,curso,periodo
0,1,Dra. Nina Silva,25,F,Matemática Aplicada,6
1,2,Maria Cecília Cavalcanti,39,F,Matemática Aplicada,1
2,3,Sr. Rodrigo Caldeira,37,F,Ciência de Dados e Inteligência Artificial,5
3,4,Raul Aragão,33,M,Ciência de Dados e Inteligência Artificial,6
4,5,Letícia da Rosa,33,M,Ciência de Dados e Inteligência Artificial,4
...,...,...,...,...,...,...
395,396,Calebe Nascimento,32,M,Matemática Aplicada,4
396,397,Benício das Neves,35,M,Matemática Aplicada,2
397,398,Alice Oliveira,31,F,Matemática Aplicada,1
398,399,Isabel Azevedo,26,M,Matemática Aplicada,8
399,400,Marcos Vinicius Gomes,42,M,Ciência de Dados e Inteligência Artificial,1

## Tabela pages_interesses_alunos

In [23]:
aluno_interesses = {
    'id': [],
    'aluno_id_id': [],
    'interesses_id_id': []
}

In [24]:
for id in range(1, 1501):
    aluno_interesses['id'].append(id),
    aluno_interesses['aluno_id_id'].append(randint(1,400)),
    aluno_interesses['interesses_id_id'].append(randint(1,210))

In [25]:
df_alunos_interesses = pd.DataFrame(aluno_interesses)
df_alunos_interesses

        id  aluno_id_id  interesses_id_id
0        1          314                55
1        2          104                66
2        3          168                53
3        4          118                56
4        5          378                79
...    ...          ...               ...
1495  1496          130                42
1496  1497           74               102
1497  1498          111                21
1498  1499          333                92
1499  1500          210                50

[1500 rows x 3 columns]

# Registrando dados no banco

In [26]:
data_int = []
for i in range(0,len(df_int)):
    tuple = (int(df_int['id'][i]), str(df_int['categoria'][i]), int(df_int['grau'][i]), (str(df_int['nome'][i])))
    data_int.append(tuple)

In [27]:
cur.executemany('INSERT INTO pages_interesses VALUES (?,?,?,?)', data_int)

In [28]:
cur.execute("SELECT * FROM pages_interesses")
for c in cur.fetchmany(15):
    print(c)

(1, 'Arte', 1, 'Musica')
(2, 'Arte', 1, 'Dança')
(3, 'Arte', 1, 'Literatura')
(4, 'Arte', 1, 'Museu')
(5, 'Arte', 1, 'Cinema')
(6, 'Arte', 1, 'Teatro')
(7, 'Esporte', 1, 'Xadrez')
(8, 'Esporte', 1, 'Volei')
(9, 'Esporte', 1, 'Futebol')
(10, 'Esporte', 1, 'Handbol')
(11, 'Esporte', 1, 'Basquete')
(12, 'Esporte', 1, 'Tenis de Mesa')
(13, 'Esporte', 1, 'Natação')
(14, 'Esporte', 1, 'Crossfit')
(15, 'Esporte', 1, 'Musculação')

In [29]:
data_alunos = []
for i in range(0,len(df_alunos)):
    tuple = (int(df_alunos['id'][i]), str(df_alunos['nome'][i]), int(df_alunos['idade'][i]), str(df_alunos['sexo'][i]), str(df_alunos['curso'][i]), int(df_alunos['periodo'][i]))
    data_alunos.append(tuple)

In [30]:
cur.executemany('INSERT INTO pages_aluno VALUES (?,?,?,?,?,?)', data_alunos)

In [31]:
cur.execute("SELECT * FROM pages_aluno")
for c in cur.fetchmany(15):
    print(c)

(1, 'Dra. Nina Silva', 25, 'F', 'Matemática Aplicada', 6)
(2, 'Maria Cecília Cavalcanti', 39, 'F', 'Matemática Aplicada', 1)
(3, 'Sr. Rodrigo Caldeira', 37, 'F', 'Ciência de Dados e Inteligência Artificial', 5)
(4, 'Raul Aragão', 33, 'M', 'Ciência de Dados e Inteligência Artificial', 6)
(5, 'Letícia da Rosa', 33, 'M', 'Ciência de Dados e Inteligência Artificial', 4)
(6, 'João Guilherme Pinto', 39, 'F', 'Matemática Aplicada', 6)
(7, 'Alexandre Aragão', 32, 'F', 'Matemática Aplicada', 3)
(8, 'Yuri Souza', 39, 'M', 'Ciência de Dados e Inteligência Artificial', 6)
(9, 'Erick Rezende', 15, 'F', 'Ciência de Dados e Inteligência Artificial', 3)
(10, 'Ana Beatriz Araújo', 24, 'F', 'Matemática Aplicada', 4)
(11, 'Matheus da Mata', 41, 'F', 'Ciência de Dados e Inteligência Artificial', 7)
(12, 'Cecília da Cruz', 19, 'M', 'Matemática Aplicada', 7)
(13, 'Ana Vitória Dias', 15, 'F', 'Ciência de Dados e Inteligência Artificial', 3)
(14, 'Luana Ramos', 18, 'M', 'Ciência de Dados e Inteligência Artificial', 8)
(15, 'Sra. Isis Lima', 40, 'F', 'Matemática Aplicada', 6)

In [32]:
data_int_alunos = []
for i in range(0,len(df_alunos_interesses)):
    tuple = (int(df_alunos_interesses['id'][i]), int(df_alunos_interesses['aluno_id_id'][i]), int(df_alunos_interesses['interesses_id_id'][i]))
    data_int_alunos.append(tuple)

In [33]:
cur.executemany('INSERT INTO pages_aluno_interesses VALUES (?,?,?)', data_int_alunos)

In [34]:
cur.execute("SELECT * FROM pages_aluno_interesses")
for c in cur.fetchmany(500):
    print(c)

(1, 314, 55)
(2, 104, 66)
(3, 168, 53)
(4, 118, 56)
(5, 378, 79)
(6, 149, 190)
(7, 110, 45)
(8, 362, 23)
(9, 194, 58)
(10, 47, 37)
(11, 246, 153)
(12, 328, 139)
(13, 273, 81)
(14, 226, 197)
(15, 397, 76)
(16, 151, 96)
(17, 45, 1)
(18, 324, 84)
(19, 18, 46)
(20, 68, 110)
(21, 191, 106)
(22, 38, 27)
(23, 64, 161)
(24, 123, 163)
(25, 378, 199)
(26, 148, 98)
(27, 14, 127)
(28, 146, 160)
(29, 161, 137)
(30, 146, 95)
(31, 161, 207)
(32, 337, 171)
(33, 223, 142)
(34, 197, 147)
(35, 57, 135)
(36, 302, 14)
(37, 329, 19)
(38, 12, 100)
(39, 231, 64)
(40, 59, 23)
(41, 345, 74)
(42, 255, 168)
(43, 185, 194)
(44, 356, 106)
(45, 178, 24)
(46, 184, 186)
(47, 264, 6)
(48, 35, 109)
(49, 253, 75)
(50, 347, 110)
(51, 113, 127)
(52, 165, 21)
(53, 197, 151)
(54, 383, 137)
(55, 371, 66)
(56, 264, 50)
(57, 202, 78)
(58, 77, 115)
(59, 117, 19)
(60, 145, 31)
(61, 373, 199)
(62, 154, 173)
(63, 123, 202)
(64, 263, 195)
(65, 100, 98)
(66, 259, 105)
(67, 390, 182)
(68, 289, 22)
(69, 290, 131)
(70, 348, 120)
(71, 157, 19)
(72, 287, 70)
(73, 205, 50)
(74, 338, 138)
(75, 240, 30)
(76, 172, 207)
(77, 309, 57)
(78, 209, 192)
(79, 214, 3)
(80, 12, 134)
(81, 139, 133)
(82, 164, 23)
(83, 219, 184)
(84, 237, 23)
(85, 348, 101)
(86, 240, 76)
(87, 61, 66)
(88, 3, 131)
(89, 359, 53)
(90, 271, 135)
(91, 96, 116)
(92, 72, 164)
(93, 16, 97)
(94, 203, 195)
(95, 266, 134)
(96, 206, 157)
(97, 218, 143)
(98, 244, 188)
(99, 32, 150)
(100, 380, 68)
(101, 139, 116)
(102, 137, 158)
(103, 17, 10)
(104, 116, 50)
(105, 397, 125)
(106, 199, 7)
(107, 59, 158)
(108, 304, 123)
(109, 329, 56)
(110, 320, 156)
(111, 241, 80)
(112, 209, 97)
(113, 197, 53)
(114, 134, 105)
(115, 310, 104)
(116, 297, 70)
(117, 208, 71)
(118, 73, 178)
(119, 38, 155)
(120, 68, 155)
(121, 103, 5)
(122, 115, 144)
(123, 116, 194)
(124, 134, 184)
(125, 108, 99)
(126, 157, 161)
(127, 216, 56)
(128, 235, 151)
(129, 63, 76)
(130, 314, 17)
(131, 342, 130)
(132, 367, 41)
(133, 344, 58)
(134, 80, 165)
(135, 143, 104)
(136, 232, 88)
(137, 316, 59)
(138, 107, 124)
(139, 256, 136)
(140, 48, 188)
(141, 342, 60)
(142, 114, 127)
(143, 168, 37)
(144, 195, 104)
(145, 90, 187)
(146, 34, 116)
(147, 195, 47)
(148, 237, 47)
(149, 150, 127)
(150, 358, 93)
(151, 117, 193)
(152, 151, 37)
(153, 52, 65)
(154, 237, 155)
(155, 9, 88)
(156, 224, 178)
(157, 394, 183)
(158, 299, 54)
(159, 288, 73)
(160, 75, 207)
(161, 40, 19)
(162, 237, 54)
(163, 123, 183)
(164, 80, 183)
(165, 292, 113)
(166, 28, 172)
(167, 368, 88)
(168, 396, 131)
(169, 105, 52)
(170, 322, 77)
(171, 28, 69)
(172, 296, 171)
(173, 177, 101)
(174, 10, 123)
(175, 357, 145)
(176, 156, 111)
(177, 103, 186)
(178, 343, 142)
(179, 161, 88)
(180, 341, 16)
(181, 12, 67)
(182, 336, 84)
(183, 9, 101)
(184, 139, 147)
(185, 161, 67)
(186, 375, 142)
(187, 26, 113)
(188, 6, 197)
(189, 235, 204)
(190, 19, 50)
(191, 196, 118)
(192, 288, 52)
(193, 97, 104)
(194, 337, 57)
(195, 151, 141)
(196, 112, 11)
(197, 379, 85)
(198, 388, 190)
(199, 205, 75)
(200, 78, 7)
(201, 300, 89)
(202, 46, 79)
(203, 246, 106)
(204, 319, 210)
(205, 283, 179)
(206, 141, 176)
(207, 32, 23)
(208, 55, 120)
(209, 148, 82)
(210, 237, 28)
(211, 178, 9)
(212, 330, 43)
(213, 352, 77)
(214, 272, 117)
(215, 361, 51)
(216, 150, 85)
(217, 324, 89)
(218, 153, 5)
(219, 261, 130)
(220, 269, 95)
(221, 11, 58)
(222, 40, 78)
(223, 204, 201)
(224, 341, 12)
(225, 26, 102)
(226, 67, 7)
(227, 354, 55)
(228, 340, 208)
(229, 23, 92)
(230, 12, 24)
(231, 336, 41)
(232, 87, 197)
(233, 245, 75)
(234, 169, 210)
(235, 139, 45)
(236, 391, 200)
(237, 213, 133)
(238, 167, 140)
(239, 14, 88)
(240, 364, 186)
(241, 366, 102)
(242, 396, 10)
(243, 314, 157)
(244, 254, 6)
(245, 268, 199)
(246, 103, 173)
(247, 242, 168)
(248, 108, 5)
(249, 273, 81)
(250, 171, 207)
(251, 106, 125)
(252, 276, 47)
(253, 34, 102)
(254, 142, 181)
(255, 57, 124)
(256, 223, 171)
(257, 323, 20)
(258, 324, 115)
(259, 92, 43)
(260, 159, 200)
(261, 393, 209)
(262, 254, 209)
(263, 221, 123)
(264, 330, 188)
(265, 67, 108)
(266, 165, 25)
(267, 211, 70)
(268, 397, 113)
(269, 12, 149)
(270, 362, 27)
(271, 132, 139)
(272, 251, 116)
(273, 261, 81)
(274, 26, 69)
(275, 400, 49)
(276, 158, 195)
(277, 277, 125)
(278, 20, 18)
(279, 86, 39)
(280, 159, 43)
(281, 91, 152)
(282, 215, 205)
(283, 280, 179)
(284, 114, 54)
(285, 35, 141)
(286, 316, 156)
(287, 159, 176)
(288, 143, 119)
(289, 234, 71)
(290, 200, 151)
(291, 230, 52)
(292, 134, 99)
(293, 312, 172)
(294, 16, 185)
(295, 218, 23)
(296, 229, 116)
(297, 80, 78)
(298, 328, 125)
(299, 138, 48)
(300, 183, 123)
(301, 267, 55)
(302, 391, 67)
(303, 375, 86)
(304, 265, 144)
(305, 226, 76)
(306, 79, 7)
(307, 23, 129)
(308, 305, 26)
(309, 272, 166)
(310, 221, 133)
(311, 205, 187)
(312, 366, 157)
(313, 379, 2)
(314, 381, 166)
(315, 386, 182)
(316, 152, 125)
(317, 39, 110)
(318, 131, 36)
(319, 202, 35)
(320, 99, 74)
(321, 61, 101)
(322, 14, 106)
(323, 207, 38)
(324, 127, 171)
(325, 164, 171)
(326, 206, 174)
(327, 376, 107)
(328, 283, 132)
(329, 178, 195)
(330, 185, 105)
(331, 93, 143)
(332, 212, 22)
(333, 323, 110)
(334, 377, 117)
(335, 310, 142)
(336, 171, 209)
(337, 332, 186)
(338, 241, 114)
(339, 223, 146)
(340, 56, 151)
(341, 238, 53)
(342, 346, 166)
(343, 269, 136)
(344, 21, 171)
(345, 237, 203)
(346, 244, 19)
(347, 25, 33)
(348, 71, 58)
(349, 287, 169)
(350, 204, 176)
(351, 63, 7)
(352, 237, 22)
(353, 352, 57)
(354, 330, 94)
(355, 72, 25)
(356, 66, 32)
(357, 61, 55)
(358, 243, 123)
(359, 199, 47)
(360, 66, 25)
(361, 35, 201)
(362, 399, 29)
(363, 270, 65)
(364, 204, 57)
(365, 368, 39)
(366, 254, 210)
(367, 67, 42)
(368, 393, 134)
(369, 370, 53)
(370, 166, 186)
(371, 37, 119)
(372, 287, 199)
(373, 128, 65)
(374, 67, 178)
(375, 49, 146)
(376, 347, 22)
(377, 359, 164)
(378, 368, 148)
(379, 332, 69)
(380, 112, 141)
(381, 371, 208)
(382, 263, 144)
(383, 45, 76)
(384, 111, 27)
(385, 268, 18)
(386, 287, 95)
(387, 336, 210)
(388, 94, 30)
(389, 342, 99)
(390, 247, 107)
(391, 160, 85)
(392, 51, 188)
(393, 294, 202)
(394, 371, 206)
(395, 206, 20)
(396, 219, 65)
(397, 362, 184)
(398, 139, 178)
(399, 256, 116)
(400, 83, 117)
(401, 69, 62)
(402, 276, 178)
(403, 253, 61)
(404, 280, 147)
(405, 153, 174)
(406, 79, 159)
(407, 154, 206)
(408, 155, 98)
(409, 121, 73)
(410, 295, 170)
(411, 47, 28)
(412, 265, 88)
(413, 165, 7)
(414, 398, 52)
(415, 13, 22)
(416, 150, 130)
(417, 270, 190)
(418, 244, 134)
(419, 236, 13)
(420, 368, 48)
(421, 244, 46)
(422, 384, 192)
(423, 102, 116)
(424, 317, 107)
(425, 265, 115)
(426, 335, 113)
(427, 211, 178)
(428, 140, 208)
(429, 25, 194)
(430, 62, 156)
(431, 133, 70)
(432, 250, 149)
(433, 214, 91)
(434, 341, 183)
(435, 295, 192)
(436, 223, 139)
(437, 16, 207)
(438, 387, 96)
(439, 255, 167)
(440, 292, 86)
(441, 214, 44)
(442, 8, 143)
(443, 121, 58)
(444, 358, 43)
(445, 399, 203)
(446, 140, 80)
(447, 97, 136)
(448, 185, 27)
(449, 81, 177)
(450, 59, 199)
(451, 349, 161)
(452, 184, 102)
(453, 195, 112)
(454, 377, 47)
(455, 369, 147)
(456, 364, 192)
(457, 119, 84)
(458, 225, 198)
(459, 382, 81)
(460, 129, 105)
(461, 222, 185)
(462, 20, 75)
(463, 355, 154)
(464, 192, 122)
(465, 326, 87)
(466, 311, 19)
(467, 15, 160)
(468, 314, 136)
(469, 95, 81)
(470, 129, 147)
(471, 234, 151)
(472, 349, 29)
(473, 230, 163)
(474, 290, 69)
(475, 35, 24)
(476, 263, 2)
(477, 258, 158)
(478, 156, 183)
(479, 390, 189)
(480, 290, 84)
(481, 65, 109)
(482, 282, 174)
(483, 345, 49)
(484, 388, 91)
(485, 207, 168)
(486, 33, 206)
(487, 365, 119)
(488, 390, 3)
(489, 128, 147)
(490, 375, 150)
(491, 17, 177)
(492, 31, 6)
(493, 275, 74)
(494, 346, 117)
(495, 48, 9)
(496, 130, 63)
(497, 143, 89)
(498, 72, 104)
(499, 251, 27)
(500, 254, 146)

## Analisando estrutura da tabela pages_aluno_interesses

In [35]:
query = '''
SELECT sql
FROM sqlite_master
WHERE name = 'pages_aluno_interesses';
'''

cur.execute(query)
for c in cur.fetchall():
    print(c[0])

CREATE TABLE "pages_aluno_interesses" ("id" integer NOT NULL PRIMARY KEY AUTOINCREMENT, "aluno_id_id" bigint NOT NULL REFERENCES "pages_aluno" ("id") DEFERRABLE INITIALLY DEFERRED, "interesses_id_id" bigint NOT NULL REFERENCES "pages_interesses" ("id") DEFERRABLE INITIALLY DEFERRED)

In [36]:
conn.commit()
conn.close()